Reports/ИспользованиеОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ИспользованиеОтпусков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьБыстрыйОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоложенныеЕжегодныеОтпускаРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПоложенныеЕжегодныеОтпускаРаботников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Положено</Name>
					<Comment>Положенное количество дней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ИспользованиеЕжегодныхОтпусковРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ИспользованиеЕжегодныхОтпусковРаботников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользованоОсновного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОтпускаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочийПериодНачало</Name>
					<Comment>Начало рабочего периода</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийПериодОкончание</Name>
					<Comment>Окончание рабочего периода</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийОтпускаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОтпускаОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОтпуска</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ИспользованиеОтпусков/Ext/ObjectModule.bsl
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ТаблицаПериодов Экспорт;

#Если Клиент ИЛИ ВнешнееСоединение Тогда

Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаПериодов", ТаблицаПериодов);
		
	Возврат ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	
КонецФункции

Процедура СформироватьВнешнийИсточникДанных(ДатаОтчета)Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
	Запрос.УстановитьПараметр("Причина", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РаботникиОрганизации.Сотрудник,
	               |	РаботникиОрганизации.Организация КАК Организация,
	               |	&ДатаОтчета КАК ДатаОкончания,
	               |	ПоложенныеОтпуска.ВидОтпуска,
	               |	Увольнение.Период КАК ДатаУвольнения
	               |ПОМЕСТИТЬ ВТРаботникиОрганизации
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций.СрезПервых(, ) КАК РаботникиОрганизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоложенныеЕжегодныеОтпускаРаботников.СрезПоследних(&ДатаОтчета, ) КАК ПоложенныеОтпуска
	               |		ПО РаботникиОрганизации.Сотрудник = ПоложенныеОтпуска.Сотрудник
	               |			И РаботникиОрганизации.Организация = ПоложенныеОтпуска.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Рабы.Организация КАК Организация,
	               |			Рабы.Сотрудник КАК Сотрудник,
	               |			Рабы.Период КАК Период
	               |		ИЗ
	               |			РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК Рабы
	               |		ГДЕ
	               |			Рабы.ПричинаИзмененияСостояния = &Причина) КАК Увольнение
	               |		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
	               |			И РаботникиОрганизации.Организация = Увольнение.Организация";
	Запрос.Выполнить();
	//Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТРаботникиОрганизации";
	//Запрос.Выполнить().Выгрузить().ВыбратьСтроку();
	
	//Получаем таблицу остатков отпусков
	ПроцедурыУправленияПерсоналом.ПолучитьТаблицуОстатковДнейОтпуска(Запрос.МенеджерВременныхТаблиц);
	
	
		//Запрос по использованным дням отпуска
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыОтпусков.Сотрудник 	КАК Сотрудник,
	|	ОборотыОтпусков.Организация	КАК Организация,
	|	ОборотыОтпусков.РабочийПериодНачало КАК РабочийПериодНачало,
	|	ОборотыОтпусков.РабочийПериодОкончание КАК РабочийПериодОкончание,
	|	ОборотыОтпусков.ВидОтпуска	КАК ВидОтпуска,
	|	ОборотыОтпусков.ПоложеноДнейОтпуска КАК ПоложеноДнейОтпуска,
	|	ОборотыОтпусков.ИспользованоДнейОтпуска КАК ИспользованоДнейОтпуска,
	|	ОборотыОтпусков.КомпенсированоДнейОтпуска КАК КомпенсированоДнейОтпуска,
	|	ЕстьNULL(ОборотыОтпусков.ПоложеноДнейОтпуска,0) -  ЕстьNULL(ОборотыОтпусков.ИспользованоДнейОтпуска,0) - ЕстьNULL(ОборотыОтпусков.КомпенсированоДнейОтпуска,0) КАК ОстатокОтпуска,
	|	ЕстьNULL(ОборотыОтпусков.ПоложеноДнейОтпуска,0) -  ЕстьNULL(ОборотыОтпусков.ИспользованоДнейОтпуска,0) - ЕстьNULL(ОборотыОтпусков.КомпенсированоДнейОтпуска,0) КАК ДоступныйОстатокОтпуска
					                     
	|ИЗ
	|(
	|  ВЫБРАТЬ
	|	ВТПоложеноДнейОтпуска.Сотрудник					КАК Сотрудник,
	|	ВТПоложеноДнейОтпуска.Организация				КАК Организация,
	|	ВТПоложеноДнейОтпуска.РабочийПериодНачало 		КАК РабочийПериодНачало,
	|	ВТПоложеноДнейОтпуска.РабочийПериодОкончание	КАК РабочийПериодОкончание,
	|	ВТПоложеноДнейОтпуска.ВидОтпуска				КАК ВидОтпуска,
	|	МАКСИМУМ(ВТПоложеноДнейОтпуска.ПоложеноДнейОтпуска)		КАК ПоложеноДнейОтпуска,
	|	СУММА(ВЫБОР 
	|		КОГДА ИспользованиеОтпусков.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтпускаОрганизаций.КомпенсацияОтпуска) ТОГДА
	|			0
	|		ИНАЧЕ                                        
	|			ИспользованиеОтпусков.ИспользованоОсновного
	|	 КОНЕЦ ) КАК ИспользованоДнейОтпуска,	
	|	СУММА(ВЫБОР                         
	|		КОГДА ИспользованиеОтпусков.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтпускаОрганизаций.КомпенсацияОтпуска) ТОГДА
	|			ИспользованиеОтпусков.ИспользованоОсновного	
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) КАК КомпенсированоДнейОтпуска
	|ИЗ
	|	ВТПоложеноДнейОтпуска КАК ВТПоложеноДнейОтпуска
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	(ВЫБРАТЬ
	|		ИспользованиеОтпусков.Сотрудник					КАК Сотрудник,
	|		ИспользованиеОтпусков.ВидОтпуска				КАК ВидОтпуска,
	|		ИспользованиеОтпусков.Организация 				КАК Организация,
	|		ИспользованиеОтпусков.РабочийПериодНачало 		КАК РабочийПериодНачало,
	|		ИспользованиеОтпусков.РабочийПериодОкончание 	КАК РабочийПериодОкончание,
	|		ИспользованиеОтпусков.ВидОперации 				КАК ВидОперации,
	|		СУММА(ИспользованиеОтпусков.ИспользованоОсновного) КАК ИспользованоОсновного
	|	ИЗ
	|	РегистрНакопления.ИспользованиеЕжегодныхОтпусковРаботников КАК ИспользованиеОтпусков
	|	СГРУППИРОВАТЬ ПО
	|		ИспользованиеОтпусков.Сотрудник,
	|		ИспользованиеОтпусков.ВидОтпуска,
	|		ИспользованиеОтпусков.Организация,
	|		ИспользованиеОтпусков.РабочийПериодНачало,
	|		ИспользованиеОтпусков.РабочийПериодОкончание,
	|		ИспользованиеОтпусков.ВидОперации
	|	)КАК ИспользованиеОтпусков
	|
	|ПО
	|	ВТПоложеноДнейОтпуска.Сотрудник = ИспользованиеОтпусков.Сотрудник	       
	|	И ИспользованиеОтпусков.РабочийПериодНачало >= ВтПоложеноДнейОтпуска.РабочийПериодНачало
	|	И ИспользованиеОтпусков.РабочийПериодОкончание <= ВтПоложеноДнейОтпуска.РабочийПериодОкончание
	|	И ВТПоложеноДнейОтпуска.Организация = ИспользованиеОтпусков.Организация
	|	И ВТПоложеноДнейОтпуска.ВидОтпуска = ИспользованиеОтпусков.ВидОтпуска
	|СГРУППИРОВАТЬ ПО
	|	ВТПоложеноДнейОтпуска.Сотрудник,
	|	ВТположеноДнейОтпуска.Организация,
	|	ВТПоложеноДнейОтпуска.РабочийПериодНачало,
	|	ВТПоложеноДнейОтпуска.РабочийПериодОкончание,
	|	ВТПоложеноДнейОтпуска.ВидОтпуска
	|) КАК ОборотыОтпусков
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаПериодов.Очистить();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПериодов.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.Организация	 = Выборка.Организация;
		НоваяСтрока.ВидОтпуска = Выборка.ВидОтпуска;
		НоваяСтрока.РабочийПериодНачало = Выборка.РабочийПериодНачало;
		НоваяСтрока.РабочийПериодОкончание = Выборка.РабочийПериодОкончание;
		НоваяСтрока.ПоложеноДнейОтпуска = Выборка.ПоложеноДнейОтпуска;
		НоваяСтрока.ИспользованоДнейОтпуска = Выборка.ИспользованоДнейОтпуска;
		НоваяСтрока.КомпенсированоДнейОтпуска = Выборка.КомпенсированоДнейОтпуска;
		НоваяСтрока.ОстатокОтпуска	= Выборка.ОстатокОтпуска;
		НоваяСтрока.ДоступныйОстатокОтпуска = Выборка.ДоступныйОстатокОтпуска;
	КонецЦикла;
			
КонецПроцедуры


// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
	
КонецПроцедуры

#КонецЕсли

#Если Клиент Тогда
	
// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	ТиповыеОтчеты.ИнициализацияТиповогоОтчета(ЭтотОбъект);
	
КонецПроцедуры

Расшифровки = Новый СписокЗначений;
//Расшифровки.Добавить("ШаблонТиповогоОтчета", "ШаблонТиповогоОтчета");

НастройкаПериода = Новый НастройкаПериода;

ТаблицаПериодов = Новый ТаблицаЗначений;
ТаблицаПериодов.Колонки.Добавить("Сотрудник");
ТаблицаПериодов.Колонки.Добавить("Организация");
ТаблицаПериодов.Колонки.Добавить("ВидОтпуска");
ТаблицаПериодов.Колонки.Добавить("РабочийПериодНачало");
ТаблицаПериодов.Колонки.Добавить("РабочийПериодОкончание");
ТаблицаПериодов.Колонки.Добавить("ПоложеноДнейОтпуска");
ТаблицаПериодов.Колонки.Добавить("ИспользованоДнейОтпуска");
ТаблицаПериодов.Колонки.Добавить("КомпенсированоДнейОтпуска");
ТаблицаПериодов.Колонки.Добавить("ОстатокОтпуска");
ТаблицаПериодов.Колонки.Добавить("ДоступныйОстатокОтпуска");

#КонецЕсли
